{-# OPTIONS --rewriting #-}
module Weaken2 where
open import Agda.Builtin.Equality
open import Agda.Builtin.Equality.Rewrite
import Relation.Binary.PropositionalEquality as Eq
open Eq using (_≡_; refl; cong; cong₂)
open Eq.≡-Reasoning using (begin_; step-≡-∣; _∎)

infix   4  _⊢_  _⊨_
infixl  5  _▷_  _⨾_
infix   5  ƛ_
infixl  7  _·_
infixr  7  _⇒_
infix   8  _↑


data Type : Set where
  `ℕ   :  Type
  _⇒_  :  Type → Type → Type

variable
  A B C : Type

_ : Type
_ = `ℕ ⇒ `ℕ

data Con : Set where
  ∅    :  Con
  _▷_  :  Con → Type → Con

variable
    Γ Δ Θ Ξ : Con

_ : Con
_ = ∅ ▷ (`ℕ ⇒ `ℕ) ▷ `ℕ

data _⊢_ : Con → Type → Set where

  ● :
      -----------
       Γ ▷ A ⊢ A

  _↑ :
      (M : Γ ⊢ B)
    → -----------
       Γ ▷ A ⊢ B

  ƛ_ :
      (N : Γ ▷ A ⊢ B)
    → ---------------
       Γ ⊢ A ⇒ B

  _·_ :
      (L : Γ ⊢ A ⇒ B)
      (M : Γ ⊢ A)
    → ---------------
       Γ ⊢ B

  zero :
       --------
        Γ ⊢ `ℕ

  suc :
      (M : Γ ⊢ `ℕ)
    → -------------
       Γ ⊢ `ℕ

variable
  L M N P Q : Γ ⊢ A

inc : ∅ ⊢ `ℕ ⇒ `ℕ
inc = ƛ (suc ●)

two : ∅ ⊢ (A ⇒ A) ⇒ A ⇒ A
two = ƛ (ƛ (● ↑ · (● ↑ · ●)))

M₀ M₁ : ∅ ▷ (A ⇒ B ⇒ C) ▷ A ▷ B ⊢ C
M₀ = ● ↑ ↑ · ● ↑ · ●
M₁ = (● ↑  · ●) ↑ · ● 

data _⊨_ : Con → Con → Set where

  id :
      -------
       Δ ⊨ Δ

  _↑ :
      (σ : Γ ⊨ Δ)
    → -----------
       Γ ▷ A ⊨ Δ

  _▷_ :
      (σ : Γ ⊨ Δ)
      (M : Γ ⊢ A)
    → -----------
       Γ ⊨ Δ ▷ A

variable
  σ τ υ : Γ ⊨ Δ

_ : ∅ ⊨ ∅ ▷ (`ℕ ⇒ `ℕ) ▷ `ℕ
_ = id ▷ inc ▷ zero

_ : ∅ ▷ `ℕ ⊨ ∅ ▷ `ℕ ⇒ `ℕ ▷ `ℕ
_ = (id ▷ inc) ↑ ▷ ●

_ : ∅ ▷ A ▷ B ⊨ ∅ ▷ B ▷ A
_ = id ↑ ↑ ▷ ● ▷ ● ↑

pattern △  =  _ ▷ _

_[_] :
    (M : Δ ⊢ A)
    (σ : Γ ⊨ Δ)
  → -----------
     Γ ⊢ A
M             [ id ]     =  M                  -- (1)
M             [ σ ↑ ]    =  (M [ σ ]) ↑        -- (2)
●             [ σ ▷ P ]  =  P                  -- (3)
(M ↑)         [ σ ▷ P ]  =  M [ σ ]            -- (4)
(ƛ N)         [ σ @ △ ]  =  ƛ (N [ σ ↑ ▷ ● ])  -- (5)
(L · M)       [ σ @ △ ]  =  L [ σ ] · M [ σ ]  -- (6)
zero          [ σ @ △ ]  =  zero               -- (7)
(suc M)       [ σ @ △ ]  =  suc (M [ σ ])      -- (8)

_ : (ƛ (● ↑ · (● ↑ · ●))) [ id ▷ inc ]  ≡  ƛ (inc ↑ · (inc ↑ · ●))
_ =
    begin
      (ƛ (● ↑ · (● ↑ · ●))) [ id ▷ inc ]
    ≡⟨⟩         -- (5)
      ƛ ((● ↑ · (● ↑ · ●)) [ (id ▷ inc) ↑ ▷ ● ])
    ≡⟨⟩         -- (6)
      ƛ (((● ↑) [ (id ▷ inc) ↑ ▷ ● ]) · ((● ↑ · ●) [ (id ▷ inc) ↑ ▷ ● ]))
    ≡⟨⟩         -- (4)
      ƛ ((● [ (id ▷ inc) ↑ ]) · ((● ↑ · ●) [ (id ▷ inc) ↑ ▷ ● ]))
    ≡⟨⟩         -- (2)
      ƛ ((● [ id ▷ inc ]) ↑ · ((● ↑ · ●) [ (id ▷ inc) ↑ ▷ ● ]))
    ≡⟨⟩         -- (3)
      ƛ (inc ↑ · ((● ↑ · ●) [ (id ▷ inc) ↑ ▷ ● ]))
    ≡⟨⟩         --  ...
      ƛ (inc ↑ · (inc ↑ · ●))
    ∎

_ : (ƛ (● ↑ · (● ↑ · ●))) [ id ▷ inc ]  ≡  ƛ (inc ↑ · (inc ↑ · ●))
_ = refl

_⨾_ :
    (σ : Θ ⊨ Δ)
    (τ : Γ ⊨ Θ)
  → -----------
     Γ ⊨ Δ
σ        ⨾  id       =  σ                    -- (1)
σ        ⨾  (τ ↑)    =  (σ ⨾ τ) ↑            -- (2)
id       ⨾  (τ @ △)  =  τ                    -- (3)
(σ ↑)    ⨾  (τ ▷ Q)  =  σ ⨾ τ                -- (4)
(σ ▷ P)  ⨾  (τ @ △)  =  (σ ⨾ τ) ▷ (P [ τ ])  -- (5)

[][] :
    (M : Δ ⊢ A)
    (σ : Θ ⊨ Δ)
    (τ : Γ ⊨ Θ)
  → -----------------------------
     M [ σ ] [ τ ] ≡ M [ σ ⨾ τ ]

[][]  M             σ        id       =  refl                                  --  (1)
[][]  M             σ        (τ ↑)    =  cong _↑ ([][] M σ τ)                  --  (2)
[][]  M             id       (τ @ △)  =  refl                                  --  (3)
[][]  M             (σ ↑)    (τ ▷ Q)  =  [][] M σ τ                            --  (4)
[][]  ●             (σ ▷ P)  (τ @ △)  =  refl                                  --  (5)
[][]  (M ↑)         (σ ▷ P)  (τ @ △)  =  [][] M σ τ                            --  (6)
[][]  (ƛ N)         (σ @ △)  (τ @ △)  =  cong ƛ_ ([][] N (σ ↑ ▷ ●) (τ ↑ ▷ ●))  --  (7)
[][]  (L · M)       (σ @ △)  (τ @ △)  =  cong₂ _·_ ([][] L σ τ) ([][] M σ τ)   --  (8)
[][]  zero          (σ @ △)  (τ @ △)  =  refl                                  --  (9)
[][]  (suc M)       (σ @ △)  (τ @ △)  =  cong suc ([][] M σ τ)                 -- (10)

{-# REWRITE [][] #-}

left-id :
    (τ : Γ ⊨ Δ)
  → ------------
     id ⨾ τ ≡ τ
left-id id       =  refl                 -- (1)
left-id (τ ↑)    =  cong _↑ (left-id τ)  -- (2)
left-id (τ ▷ Q)  =  refl                 -- (3)

{-# REWRITE left-id #-}

assoc :
    (σ : Θ ⊨ Δ)
    (τ : Ξ ⊨ Θ)
    (υ : Γ ⊨ Ξ)
  → ---------------------------
     (σ ⨾ τ) ⨾ υ ≡ σ ⨾ (τ ⨾ υ)
assoc  σ        τ        id       =  refl                                      -- (1)
assoc  σ        τ        (υ ↑)    =  cong _↑ (assoc σ τ υ)                     -- (2)
assoc  σ        id       (υ ▷ R)  =  refl                                      -- (3)
assoc  σ        (τ ↑)    (υ ▷ R)  =  assoc σ τ υ                               -- (4)
assoc  id       (τ ▷ Q)  (υ ▷ R)  =  refl                                      -- (5)
assoc  (σ ↑)    (τ ▷ Q)  (υ ▷ R)  =  assoc σ τ (υ ▷ R)                         -- (6)
assoc  (σ ▷ P)  (τ ▷ Q)  (υ ▷ R)  =  cong₂ _▷_ (assoc σ (τ ▷ Q) (υ ▷ R)) refl  -- (7)

{-# REWRITE assoc #-}

_[_]₀ :
    (N : Γ ▷ A ⊢ B)
    (M : Γ ⊢ A)
  → ----------------
     Γ ⊢ B
N [ M ]₀ = N [ id ▷ M ]

_[_]₁ :
    (N : Γ ▷ A ▷ B ⊢ C)
    (M : Γ ⊢ A)
  → -------------------
     Γ ▷ B ⊢ C
N [ M ]₁ = N [ (id ▷ M) ↑ ▷ ● ]

introduction : (N ↑) [ M ]₀ ≡ N
introduction = refl

double-subst : N [ M ]₁ [ L ]₀ ≡ N [ L ↑ ]₀ [ M ]₀

double-subst = refl

commute-subst : N [ M ]₀ [ L ]₀ ≡ N [ L ]₁ [ M [ L ]₀ ]₀

commute-subst = refl
